       IDENTIFICATION DIVISION.
       PROGRAM-ID USER-SAVINGS.
       AUTHOR DARL-FLORESCA.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SAVINGS-FILE ASSIGN TO "SAVINGS.DAT".
       
       DATA DIVISION.
       FILE SECTION.
       FD SAVINGS-FILE.
       
       PROCEDURE DIVISION.
           STOP RUN.